<?php
          //================== Страница обработчик на добавления в друзя ==================//
					/*
					1 створити табличку "друзі"  - виконав 
					2 створити силку  на додавання у друзі - готово 
					3 створити сторінку опрацювання даних з GET запиту на додавання у друзі - готово 
					4 перенаправлення  користувача  на головну сторінку - готово 
					*/ 

// подключаем фаил с настройками базы даных
    include "configs/bd.php";

   	if(isset($_COOKIE["polzovatel_id"])) {
  // перезаписываем значения  polzovatel_id
  $polzovatel_id = $_COOKIE["polzovatel_id"];
}
    // якщо існує GET запрос  з "user_id" відправлений з  модального вікна Контакти то 
	if (isset($_GET["user_id"])) {
        // відправляемо  у Б.Д.  у таблицю frends на створення нового запису
        // us_f1- ID користувача  взятий  з COOKIE
        // us_f2 - ID користувача взятий з GET запросу 
        $sql = "INSERT INTO frends (us_f1, us_f2) 
        VALUES ('" . $polzovatel_id . "','" . $_GET["user_id"] . "')";
		// якщо створення нового запису  пройшло вдало  то 
		 if (mysqli_query($connect, $sql)) {
		 	// перенаправляєм назад на вікно з контактами  
		include "modules/frend_list.php";
		 } else {
		 	// або  видати помилку  тобто даний користувач  вже добавлений у наші ДРУЗІ 
		 	echo "<h2>ошибка</h2>";
		 }
		
	}
   


?>