<?php
// =========================== Страница обработчик удаления друзей ====================================//

/*
1 створити силку  на видалення з друзів - готово 
2 створити сторінку опрацювання даних з GET запиту на додавання у друзі - готово 
3 перенаправлення  користувача  на головну сторінку - готово 
*/ 

// подключаем фаил с настройками базы даных
    include "configs/bd.php"; 

	if(isset($_COOKIE["polzovatel_id"])) {
  // перезаписываем значения  polzovatel_id
  $polzovatel_id = $_COOKIE["polzovatel_id"];
}

// якщо існує GET запрос  з "user_id" відправлений з  модального вікна Контакти то 
// створюєм запит у базу на видалення з таблиці ДРУЗІ 
	if (isset($_GET["user_id"])) {
		$sql = "DELETE FROM `frends` WHERE `frends`.`us_f1` = '" . $polzovatel_id . "' AND `frends`.`us_f2` =" . $_GET["user_id"];


		

		if (mysqli_query($connect, $sql)) {
		 	// перенаправляєм на головну сторінку 
		 	include "modules/frend_list.php";
		 } else {
		 	// або  видати помилку  тобто даний користувач  вже добавлений у наші ДРУЗІ 
		 	echo "<h2>ошибка</h2>";
		 }

	}

?>